app/controllers/workouts_controller.rb

	def index
		# list all workouts with ID in descending order
		@workouts = Workout.all.order(id: :desc)
		# initiate randomizer for quotes
		num = rand(1..10)
		# set variable to random quote from database
		@motivation = Motivation.find(num)
---
SELECT "workouts".* FROM "workouts" ORDER BY "workouts"."id" DESC
SELECT  "motivations".* FROM "motivations" WHERE "motivations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def show
		# find specified workout
		@workout = Workout.find(params[:id])
		# list all workouts with ID in desc order
		@workouts = Workout.all.order(id: :desc)
		# initiate randomizer for quotes
		num = rand(1..10)
		# set variable to random quote from db
		@motivation = Motivation.find(num)
---
SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "motivations".* FROM "motivations" WHERE "motivations"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

	def new
		# create new workout
		@workout = Workout.new
		# initiate randomizer for quote
		num = rand(1..10)
		# set variable to random quote
		@motivation = Motivation.find(num)
---
SELECT  "motivations".* FROM "motivations" WHERE "motivations"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

	def create
		# create a new workout with params from private method
		@workout = Workout.new(workout_params)
		# set variable to random number
		num = rand(1..10)
		# declare quote variable
		@motivation = Motivation.find(num)
		# if the workout is saved successfully
		if @workout.save
---
SELECT  "motivations".* FROM "motivations" WHERE "motivations"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "workouts" ("name", "muscle_group", "sets", "reps", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Squats"], ["muscle_group", "Legs"], ["sets", 5], ["reps", 10], ["date", "12/9/2017"], ["created_at", "2017-12-09 19:30:19.322932"], ["updated_at", "2017-12-09 19:30:19.322932"]]

	def edit
		# pull in set workout
		@workout = Workout.find(params[:id])
		# pull random number
		num = rand(1..10)
		# set variable to random quote
		@motivation = Motivation.find(num)
---
SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "motivations".* FROM "motivations" WHERE "motivations"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

	def update
		# set selected workout to variable
		@workout = Workout.find(params[:id])
		# if the workout is successfully updated
		if @workout.update(workout_params)
---
SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "workouts" SET "sets" = $1, "updated_at" = $2 WHERE "workouts"."id" = $3  [["sets", 6], ["updated_at", "2017-12-09 19:11:41.583367"], ["id", 3]]

	def destroy
		# find specified workout
		@workout = Workout.find(params[:id])
		# list all motivation quotes
		@motivations = Motivation.all
		# delete workout
		@workout.delete
---
SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "workouts" WHERE "workouts"."id" = $1  [["id", 8]]